#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.feyre_test.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/10586921-4e01-4730-961b-4188fcaee088/resourceGroups/Feyre/providers/Microsoft.Network/virtualNetworks/feyre_dev_containers]
module.feyre_test.azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/10586921-4e01-4730-961b-4188fcaee088/resourceGroups/Feyre/providers/Microsoft.Network/virtualNetworks/feyre_dev_containers/subnets/feyre_dev_default_subnet]
module.feyre_test.azurerm_network_profile.net_profile: Refreshing state... [id=/subscriptions/10586921-4e01-4730-961b-4188fcaee088/resourceGroups/Feyre/providers/Microsoft.Network/networkProfiles/feyre_dev_container_net_profile]
module.feyre_test.azurerm_container_group.container_group: Refreshing state... [id=/subscriptions/10586921-4e01-4730-961b-4188fcaee088/resourceGroups/Feyre/providers/Microsoft.ContainerInstance/containerGroups/feyre_dev]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.feyre_test.azurerm_container_group.container_group must be replaced
-/+ resource "azurerm_container_group" "container_group" {
      + fqdn                = (known after apply)
      ~ id                  = "/subscriptions/10586921-4e01-4730-961b-4188fcaee088/resourceGroups/Feyre/providers/Microsoft.ContainerInstance/containerGroups/feyre_dev" -> (known after apply)
      ~ ip_address          = "10.2.0.4" -> (known after apply)
        name                = "feyre_dev"
        tags                = {
            "managed_by" = "terraform"
        }
        # (6 unchanged attributes hidden)

      ~ container {
          ~ image                        = "feyre.azurecr.io/feyre:dev-3a2a9400fea596e2c285de5009f0a95774108c66" -> "feyre.azurecr.io/feyre:dev-24a4078d885fff4dd61323cd0dd9c9c3cdb8aa76" # forces replacement
            name                         = "feyre-dev"
            # (5 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @GrantBirki, Action: `pull_request`, Working Directory: ``, Workflow: `Deploy Dev 🚀`*